# INTRODUCTION TO PANDAS

# creating series and creating dataframe from the series

In [40]:
#creating series
import pandas as pd
car_price = pd.Series(['$2000', '$2300', '$4000', '$2000','$18000'])
car_make =pd.Series(['Toyota', 'Mitsuibush', 'Datsun', 'Lexus', 'Toyota'])

In [41]:
#creating dataframe 
car_data = pd.DataFrame({
    'car_make': car_make,
    'car-price': car_price
})

# Viewing The dataframe

In [42]:
car_data

     car_make car-price
0      Toyota     $2000
1  Mitsuibush     $2300
2      Datsun     $4000
3       Lexus     $2000
4      Toyota    $18000

# Adding another columns to the dataframe from python list

In [43]:
car_data['seat_number'] = [2,4,4,7,4]

In [44]:
car_data['horse_power'] = [114, 230, 345, 120, 110]

In [45]:
car_data['fuel_used(Ltr)'] =  [10000, 2000, 9320, 45000, 2104]

In [46]:
car_data['Milage(KM)'] = [2000,200,3200, 10450, 230]

In [47]:
car_data

     car_make car-price  seat_number  horse_power  fuel_used(Ltr)  Milage(KM)
0      Toyota     $2000            2          114           10000        2000
1  Mitsuibush     $2300            4          230            2000         200
2      Datsun     $4000            4          345            9320        3200
3       Lexus     $2000            7          120           45000       10450
4      Toyota    $18000            4          110            2104         230

# creating another column from combination of two column

In [48]:
car_data['life fuel used'] = car_data['fuel_used(Ltr)']*car_data['Milage(KM)']

In [49]:
car_data

,car_make,car-price,seat_number,horse_power,fuel_used(Ltr),Milage(KM),life fuel used
0,Toyota,$2000,2,114,10000,2000,20000000
1,Mitsuibush,$2300,4,230,2000,200,400000
2,Datsun,$4000,4,345,9320,3200,29824000
3,Lexus,$2000,7,120,45000,10450,470250000
4,Toyota,$18000,4,110,2104,230,483920

# analysis and getting info from a data frame

In [51]:
car_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   car_make        5 non-null      object
 1   car-price       5 non-null      object
 2   seat_number     5 non-null      int64
 3   horse_power     5 non-null      int64
 4   fuel_used(Ltr)  5 non-null      int64
 5   Milage(KM)      5 non-null      int64
 6   life fuel used  5 non-null      int64
dtypes: int64(5), object(2)
memory usage: 408.0+ bytes

In [54]:
car_data.describe()

       seat_number  horse_power  fuel_used(Ltr)    Milage(KM)  life fuel used
count     5.000000     5.000000        5.000000      5.000000    5.000000e+00
mean      4.200000   183.800000    13684.800000   3216.000000    1.041916e+08
std       1.788854   103.088312    17915.917928   4237.396606    2.050277e+08
min       2.000000   110.000000     2000.000000    200.000000    4.000000e+05
25%       4.000000   114.000000     2104.000000    230.000000    4.839200e+05
50%       4.000000   120.000000     9320.000000   2000.000000    2.000000e+07
75%       4.000000   230.000000    10000.000000   3200.000000    2.982400e+07
max       7.000000   345.000000    45000.000000  10450.000000    4.702500e+08

In [60]:
car_data.dtypes

car_make          object
car-price         object
seat_number        int64
horse_power        int64
fuel_used(Ltr)     int64
Milage(KM)         int64
life fuel used     int64
dtype: object

In [65]:
# Checking for missing number.
car_data.isnull().sum()

car_make          0
car-price         0
seat_number       0
horse_power       0
fuel_used(Ltr)    0
Milage(KM)        0
life fuel used    0
dtype: int64

In [70]:
#Checking the list and header in dataframe
car_data.columns

Index(['car_make', 'car-price', 'seat_number', 'horse_power', 'fuel_used(Ltr)',
       'Milage(KM)', 'life fuel used'],
      dtype='object')

# saving The data

In [68]:
car_data.to_csv('car_dataframe.csv',index=False)